Anobium/Great-Cow-BASIC-Library-Development/Ethernet/ENC28J60/05042016/tools/PIC18F66J60-DK-C/PIC18F66J60-DK-C/Code/Microchip Solutions Web/TCPIP WebVend App/MainDemo.c
			// Copy string into AppConfig
			strcpypgm2ram((char*)AppConfig.readCommunity[i], strCommunity);

			// Get a pointer to the next community string
			strCommunity = cWriteCommunities[i];
			if(i >= sizeof(cWriteCommunities)/sizeof(cWriteCommunities[0]))
				strCommunity = "";

			// Ensure we don't buffer overflow.  If your code gets stuck here, 
			// it means your SNMP_COMMUNITY_MAX_LEN definition in TCPIPConfig.h 
			// is either too small or one of your community string lengths 
			// (SNMP_WRITE_COMMUNITIES) are too large.  Fix either.
			if(strlenpgm(strCommunity) >= sizeof(AppConfig.writeCommunity[0]))
				while(1);

			// Copy string into AppConfig
			strcpypgm2ram((char*)AppConfig.writeCommunity[i], strCommunity);
		}
	}
	#endif


	// Vending machine specific defaults
	strcpypgm2ram((char*)Products[0].name, (ROM char*)"Cola");
	strcpypgm2ram((char*)Products[1].name, (ROM char*)"Diet Cola");
	strcpypgm2ram((char*)Products[2].name, (ROM char*)"Root Beer");
	strcpypgm2ram((char*)Products[3].name, (ROM char*)"Orange");
	strcpypgm2ram((char*)Products[4].name, (ROM char*)"Lemonade");
	strcpypgm2ram((char*)Products[5].name, (ROM char*)"Iced Tea");
	strcpypgm2ram((char*)Products[6].name, (ROM char*)"Water");
	Products[0].price = 4;
	Products[1].price = 4;
	Products[2].price = 4;
	Products[3].price = 4;
	Products[4].price = 5;
	Products[5].price = 7;
	Products[6].price = 8;
	strcpypgm2ram((char*)machineDesc, (ROM char*)"Building C4 - 2nd Floor NW");
	machineDesc[32] = '\0';
	curItem = 0;
	curCredit = 0;

	// Load the default NetBIOS Host Name
	memcpypgm2ram(AppConfig.NetBIOSName, (ROM void*)MY_DEFAULT_HOST_NAME, 16);
	FormatNetBIOSName(AppConfig.NetBIOSName);

	#if defined(ZG_CS_TRIS)
		// Load the default SSID Name
		if (sizeof(MY_DEFAULT_SSID_NAME) > sizeof(AppConfig.MySSID))
		{
		    ZGSYS_DRIVER_ASSERT(5, (ROM char *)"AppConfig.MySSID[] too small.\n");
		}
		memcpypgm2ram(AppConfig.MySSID, (ROM void*)MY_DEFAULT_SSID_NAME, sizeof(MY_DEFAULT_SSID_NAME));
	#endif

	#if defined(EEPROM_CS_TRIS)
	{
		BYTE c;
		
	    // When a record is saved, first byte is written as 0x60 to indicate
	    // that a valid record was saved.  Note that older stack versions
		// used 0x57.  This change has been made to so old EEPROM contents
		// will get overwritten.  The AppConfig() structure has been changed,
		// resulting in parameter misalignment if still using old EEPROM
		// contents.
		XEEReadArray(0x0000, &c, 1);
		if(c == 0x42u)
		{
			XEEReadArray(0x0001, (BYTE*)&AppConfig, sizeof(AppConfig));
			XEEReadArray(0x0001 + sizeof(AppConfig), (BYTE*)&Products, sizeof(Products));
			XEEReadArray(0x0001 + sizeof(AppConfig) + sizeof(Products), (BYTE*)&machineDesc, sizeof(machineDesc));
		}
	    else
	        SaveAppConfig();
	}
	#elif defined(SPIFLASH_CS_TRIS)
	{
		BYTE c;
		
		SPIFlashReadArray(0x0000, &c, 1);
		if(c == 0x42u)
		{
			SPIFlashReadArray(0x0001, (BYTE*)&AppConfig, sizeof(AppConfig));
			SPIFlashReadArray(0x0001 + sizeof(AppConfig), (BYTE*)&Products, sizeof(Products));
			SPIFlashReadArray(0x0001 + sizeof(AppConfig) + sizeof(Products), (BYTE*)&machineDesc, sizeof(machineDesc));
		}
		else
			SaveAppConfig();
	}
	#endif

	// Update with default stock values on every reboot
	Products[0].stock = 15;
	Products[1].stock = 9;
	Products[2].stock = 22;
	Products[3].stock = 18;
	Products[4].stock = 4;
	Products[5].stock = 29;
	Products[6].stock = 14;
}

#if defined(EEPROM_CS_TRIS) || defined(SPIFLASH_CS_TRIS)
void SaveAppConfig(void)
{
	// Ensure adequate space has been reserved in non-volatile storage to 
	// store the entire AppConfig structure.  If you get stuck in this while(1) 
	// trap, it means you have a design time misconfiguration in TCPIPConfig.h.
	// You must increase MPFS_RESERVE_BLOCK to allocate more space.
	#if defined(STACK_USE_MPFS) || defined(STACK_USE_MPFS2)
		if(sizeof(AppConfig) + sizeof(Products) + sizeof(machineDesc) > MPFS_RESERVE_BLOCK)
			while(1);
	#endif

	#if defined(EEPROM_CS_TRIS)
	    XEEBeginWrite(0x0000);
	    XEEWrite(0x60);
	    XEEWriteArray((BYTE*)&AppConfig, sizeof(AppConfig));
		XEEWriteArray((BYTE*)&Products, sizeof(Products));
		XEEWriteArray((BYTE*)&machineDesc, sizeof(machineDesc));
    #else
    	SPIFlashBeginWrite(0x0000);
    	SPIFlashWrite(0x60);
    	SPIFlashWriteArray((BYTE*)&AppConfig, sizeof(AppConfig));
    	SPIFlashWriteArray((BYTE*)&Products, sizeof(Products));
		SPIFlashWriteArray((BYTE*)&machineDesc, sizeof(machineDesc));
    #endif
}
#endif

